[api] Implement barcode scan and free text product search in backend
